Question 1:

Explain the fundamental differences between DDL, DML, and DQL commands in SQL. Provide one example for each type of command.

>>Answer:
SQL commands are divided into categories based on their functionality.
The three main types are:

| Type    | Full Form                  | Purpose                                                                                   | Example                                             |
| ------- | -------------------------- | ----------------------------------------------------------------------------------------- | --------------------------------------------------- |
| **DDL** | Data Definition Language   | Defines or changes the structure of database objects such as tables, schemas, or indexes. | `CREATE TABLE students (id INT, name VARCHAR(50));` |
| **DML** | Data Manipulation Language | Used to modify or manage data stored in the database.                                     | `INSERT INTO students VALUES (1, 'Srushti');`       |
| **DQL** | Data Query Language        | Used to retrieve data from database tables.                                               | `SELECT * FROM students;`                           |

In short:

DDL changes structure,

DML changes data,

DQL retrieves data.

Question 2:

What is the purpose of SQL constraints? Name and describe three common types of constraints, providing a simple scenario where each would be useful.

>>Answer:
SQL constraints are rules applied to table columns to ensure data accuracy, integrity, and reliability.

| Constraint      | Description                                                | Example Scenario                                                         |
| --------------- | ---------------------------------------------------------- | ------------------------------------------------------------------------ |
| **PRIMARY KEY** | Uniquely identifies each record in a table.                | `student_id` in a `students` table ensures no duplicate IDs.             |
| **FOREIGN KEY** | Ensures referential integrity between two tables.          | `course_id` in `enrollments` table refers to `course_id` in `courses`.   |
| **CHECK**       | Ensures that values in a column meet a specific condition. | `CHECK (age >= 18)` in a `students` table ensures only adults are added. |

In [ ]:
CREATE TABLE students (
  student_id INT PRIMARY KEY,
  name VARCHAR(50),
  age INT CHECK(age >= 18)
);

Question 3:

Explain the difference between LIMIT and OFFSET clauses in SQL. How would you use them together to retrieve the third page of results, assuming each page has 10 records?

>>Ans:
| Clause     | Function                                                          |
| ---------- | ----------------------------------------------------------------- |
| **LIMIT**  | Specifies how many rows to return.                                |
| **OFFSET** | Skips a certain number of rows before starting to return results. |

To retrieve the third page (10 records per page):

Each page = 10 records

Page 1 → skip 0, Page 2 → skip 10, Page 3 → skip 20

In [ ]:
SELECT * FROM students
LIMIT 10 OFFSET 20;

#Explanation:
#OFFSET 20 skips the first 20 rows
#LIMIT 10 fetches the next 10 rows (records 21–30)

Question 4:

What is a Common Table Expression (CTE) in SQL, and what are its main benefits? Provide a simple SQL example demonstrating its usage.

>>Answer:
A CTE (Common Table Expression) is a temporary, named result set that exists only for the duration of a single SQL query.
It makes queries easier to read, modular, and reusable.

Benefits:

Improves readability and structure of complex queries

Helps avoid repeating subqueries

Can be recursive for hierarchical data (like employee-manager relationships)

In [ ]:
WITH HighSalary AS (
  SELECT name, salary
  FROM employees
  WHERE salary > 60000
)
SELECT name FROM HighSalary;


#Explanation:
#The WITH clause defines a CTE named HighSalary.
#The main query then retrieves names from that temporary result set.

Question 5:

Describe the concept of SQL Normalization and its primary goals. Briefly explain the first three normal forms (1NF, 2NF, 3NF).

>>Answer:
Normalization is the process of organizing data in a database to reduce redundancy and improve data integrity.

Primary Goals:

Eliminate duplicate data

Ensure logical data storage

Simplify maintenance and updates

| Normal Form                  | Rule                                                                                                     | Example                                                                                                       |
| ---------------------------- | -------------------------------------------------------------------------------------------------------- | ------------------------------------------------------------------------------------------------------------- |
| **1NF (First Normal Form)**  | Each column must have atomic (indivisible) values.                                                       | A “subjects” column containing “Math, English” violates 1NF.                                                  |
| **2NF (Second Normal Form)** | Table must be in 1NF and have no partial dependency (non-key attributes depend on the full primary key). | In a table with composite key (student_id, course_id), “student_name” should not depend on only `student_id`. |
| **3NF (Third Normal Form)**  | Table must be in 2NF and have no transitive dependency.                                                  | Non-key fields (like “department_name”) shouldn’t depend on another non-key field (like “department_id”).     |


## ✅ **Question 6 Answer**

### **Create Database**

```sql
CREATE DATABASE ECommerceDB;
USE ECommerceDB;
```

---

### **Create Tables**

```sql
-- Categories Table
CREATE TABLE Categories (
  CategoryID INT PRIMARY KEY,
  CategoryName VARCHAR(50) NOT NULL UNIQUE
);

-- Products Table
CREATE TABLE Products (
  ProductID INT PRIMARY KEY,
  ProductName VARCHAR(100) NOT NULL UNIQUE,
  CategoryID INT,
  Price DECIMAL(10,2) NOT NULL,
  StockQuantity INT,
  FOREIGN KEY (CategoryID) REFERENCES Categories(CategoryID)
);

-- Customers Table
CREATE TABLE Customers (
  CustomerID INT PRIMARY KEY,
  CustomerName VARCHAR(100) NOT NULL,
  Email VARCHAR(100) UNIQUE,
  JoinDate DATE
);

-- Orders Table
CREATE TABLE Orders (
  OrderID INT PRIMARY KEY,
  CustomerID INT,
  OrderDate DATE NOT NULL,
  TotalAmount DECIMAL(10,2),
  FOREIGN KEY (CustomerID) REFERENCES Customers(CustomerID)
);
```

---

### **Insert Data**

#### **1. Categories**

```sql
INSERT INTO Categories (CategoryID, CategoryName)
VALUES
(1, 'Electronics'),
(2, 'Books'),
(3, 'Home Goods'),
(4, 'Apparel');
```

---

#### **2. Products**

```sql
INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity)
VALUES
(101, 'Laptop Pro', 1, 1200.00, 50),
(102, 'SQL Handbook', 2, 45.50, 200),
(103, 'Smart Speaker', 1, 99.99, 150),
(104, 'Coffee Maker', 3, 75.00, 80),
(105, 'Novel : The Great SQL', 2, 25.00, 120),
(106, 'Wireless Earbuds', 1, 150.00, 100),
(107, 'Blender X', 3, 120.00, 60),
(108, 'T-Shirt Casual', 4, 20.00, 300);
```

---

#### **3. Customers**

```sql
INSERT INTO Customers (CustomerID, CustomerName, Email, JoinDate)
VALUES
(1, 'Alice Wonderland', 'alice@example.com', '2023-01-10'),
(2, 'Bob the Builder', 'bob@example.com', '2022-11-25'),
(3, 'Charlie Chaplin', 'charlie@example.com', '2023-03-01'),
(4, 'Diana Prince', 'diana@example.com', '2021-04-26');
```

---

#### **4. Orders**

```sql
INSERT INTO Orders (OrderID, CustomerID, OrderDate, TotalAmount)
VALUES
(1001, 1, '2023-04-26', 1245.50),
(1002, 2, '2023-10-12', 99.99),
(1003, 1, '2023-07-01', 145.00),
(1004, 3, '2023-01-14', 150.00),
(1005, 2, '2023-09-24', 120.00),
(1006, 1, '2023-06-19', 20.00);
```

---

### ✅ **Verification Queries**

After inserting, you can check each table using:

```sql
SELECT * FROM Categories;
SELECT * FROM Products;
SELECT * FROM Customers;
SELECT * FROM Orders;
```

In [ ]:
#Question 6 Answer:

#Create Database

CREATE DATABASE ECommerceDB;
USE ECommerceDB;


#Create Tables

#Categories Table
CREATE TABLE Categories (
  CategoryID INT PRIMARY KEY,
  CategoryName VARCHAR(50) NOT NULL UNIQUE
);

#Products Table
CREATE TABLE Products (
  ProductID INT PRIMARY KEY,
  ProductName VARCHAR(100) NOT NULL UNIQUE,
  CategoryID INT,
  Price DECIMAL(10,2) NOT NULL,
  StockQuantity INT,
  FOREIGN KEY (CategoryID) REFERENCES Categories(CategoryID)
);

#Customers Table
CREATE TABLE Customers (
  CustomerID INT PRIMARY KEY,
  CustomerName VARCHAR(100) NOT NULL,
  Email VARCHAR(100) UNIQUE,
  JoinDate DATE
);

-- Orders Table
CREATE TABLE Orders (
  OrderID INT PRIMARY KEY,
  CustomerID INT,
  OrderDate DATE NOT NULL,
  TotalAmount DECIMAL(10,2),
  FOREIGN KEY (CustomerID) REFERENCES Customers(CustomerID)
);

#Insert Data

#1. Categories

INSERT INTO Categories (CategoryID, CategoryName)
VALUES
(1, 'Electronics'),
(2, 'Books'),
(3, 'Home Goods'),
(4, 'Apparel');


#2. Products

INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity)
VALUES
(101, 'Laptop Pro', 1, 1200.00, 50),
(102, 'SQL Handbook', 2, 45.50, 200),
(103, 'Smart Speaker', 1, 99.99, 150),
(104, 'Coffee Maker', 3, 75.00, 80),
(105, 'Novel : The Great SQL', 2, 25.00, 120),
(106, 'Wireless Earbuds', 1, 150.00, 100),
(107, 'Blender X', 3, 120.00, 60),
(108, 'T-Shirt Casual', 4, 20.00, 300);

#3. Customers

INSERT INTO Customers (CustomerID, CustomerName, Email, JoinDate)
VALUES
(1, 'Alice Wonderland', 'alice@example.com', '2023-01-10'),
(2, 'Bob the Builder', 'bob@example.com', '2022-11-25'),
(3, 'Charlie Chaplin', 'charlie@example.com', '2023-03-01'),
(4, 'Diana Prince', 'diana@example.com', '2021-04-26');


#4. Orders

INSERT INTO Orders (OrderID, CustomerID, OrderDate, TotalAmount)
VALUES
(1001, 1, '2023-04-26', 1245.50),
(1002, 2, '2023-10-12', 99.99),
(1003, 1, '2023-07-01', 145.00),
(1004, 3, '2023-01-14', 150.00),
(1005, 2, '2023-09-24', 120.00),
(1006, 1, '2023-06-19', 20.00);


#Verification Queries

After inserting, you can check each table using:


SELECT * FROM Categories;
SELECT * FROM Products;
SELECT * FROM Customers;
SELECT * FROM Orders;

Question 7
Generate report showing CustomerName, Email, and TotalNumberofOrders

In [ ]:
SELECT
    c.CustomerName,
    c.Email,
    COUNT(o.OrderID) AS TotalNumberOfOrders
FROM
    Customers c
LEFT JOIN
    Orders o ON c.CustomerID = o.CustomerID
GROUP BY
    c.CustomerName, c.Email
ORDER BY
    c.CustomerName;

Explanation:

LEFT JOIN ensures customers with no orders are still included.

COUNT(OrderID) counts total orders per customer (returns 0 for those without any).

ORDER BY CustomerName sorts results alphabetically.

Question 8
Retrieve Product Information with Category

In [ ]:
SELECT
    p.ProductName,
    p.Price,
    p.StockQuantity,
    c.CategoryName
FROM
    Products p
INNER JOIN
    Categories c ON p.CategoryID = c.CategoryID
ORDER BY
    c.CategoryName,
    p.ProductName;

Explanation:

INNER JOIN connects products with their respective category.

Sorted first by CategoryName, then by ProductName alphabetically.

Question 9
Top 2 Most Expensive Products in Each Category using CTE + Window Function

In [ ]:
WITH RankedProducts AS (
    SELECT
        c.CategoryName,
        p.ProductName,
        p.Price,
        RANK() OVER (PARTITION BY c.CategoryName ORDER BY p.Price DESC) AS rnk
    FROM
        Products p
    INNER JOIN
        Categories c ON p.CategoryID = c.CategoryID
)
SELECT
    CategoryName, ProductName, Price
FROM
    RankedProducts
WHERE
    rnk <= 2
ORDER BY
    CategoryName, Price DESC;

Explanation:

The CTE (RankedProducts) ranks products by price within each category.

RANK() assigns rank numbers — ties share the same rank.

The main query filters for only the top 2 products per category.

Question 10: Sakila Video Rentals Analysis

In [ ]:
#Top 5 Customers by Total Amount Spent

SELECT
    CONCAT(c.first_name, ' ', c.last_name) AS CustomerName,
    c.email,
    SUM(p.amount) AS TotalAmountSpent
FROM
    payment p
INNER JOIN
    customer c ON p.customer_id = c.customer_id
GROUP BY
    c.customer_id
ORDER BY
    TotalAmountSpent DESC
LIMIT 5;


#Top 3 Movie Categories with Highest Rental Counts

SELECT
    cat.name AS CategoryName,
    COUNT(r.rental_id) AS RentalCount
FROM
    rental r
INNER JOIN
    inventory i ON r.inventory_id = i.inventory_id
INNER JOIN
    film_category fc ON i.film_id = fc.film_id
INNER JOIN
    category cat ON fc.category_id = cat.category_id
GROUP BY
    cat.category_id
ORDER BY
    RentalCount DESC
LIMIT 3;

#Films per Store and Count of Never Rented Films

SELECT
    s.store_id,
    COUNT(DISTINCT i.film_id) AS TotalFilms,
    SUM(CASE WHEN r.rental_id IS NULL THEN 1 ELSE 0 END) AS NeverRentedFilms
FROM
    store s
INNER JOIN
    inventory i ON s.store_id = i.store_id
LEFT JOIN
    rental r ON i.inventory_id = r.inventory_id
GROUP BY
    s.store_id;

#Total Revenue per Month for 2023

SELECT
    DATE_FORMAT(payment_date, '%Y-%m') AS Month,
    SUM(amount) AS TotalRevenue
FROM
    payment
WHERE
    YEAR(payment_date) = 2023
GROUP BY
    Month
ORDER BY
    Month;

#Customers Who Rented More Than 10 Times in Last 6 Months

SELECT
    CONCAT(c.first_name, ' ', c.last_name) AS CustomerName,
    c.email,
    COUNT(r.rental_id) AS TotalRentals
FROM
    customer c
INNER JOIN
    rental r ON c.customer_id = r.customer_id
WHERE
    r.rental_date >= DATE_SUB(CURDATE(), INTERVAL 6 MONTH)
GROUP BY
    c.customer_id
HAVING
    TotalRentals > 10
ORDER BY
    TotalRentals DESC;